// Домашня робота:
// ============= 1 Завдання =================
// Знайдіть всі великі літери в тексті і збережіть їх в масив

let textStr = "    Lorem ipsum dolor sit amet consectetur adipisicing elit. Eos itaque vero laborum fugit harum! Quia, cumque necessitatibus nemo veniam odit dolor impedit aspernatur, ipsa vitae minima quasi doloribus repellendus cupiditate!";

let searchCapslockLeter = /[A-Z]/g;
let result = textStr.match(searchCapslockLeter);
console.log(result);

// ============= 2 Завдання =================
// Знаходження слів із певною кількістю символів:
// Напишіть регулярний вираз для знаходження слів у тексті, що складаються рівно з 5 букв, можна взяти текст з textStr з першого завдання

let searchFiveLeterWord = /\w{5}/g;
let result2 = textStr.match(searchFiveLeterWord);
console.log(result2);

// ============= 3 Завдання =================
// Створити регулярний вираз, який видаляє всі HTML теги з рядка. Наприклад, після обробки рядка <p>Це - простий <b>текст</b>.</p> має залишитися Це - простий текст.

let theText = `4{<p>}Це - простий {<b>}текст{</b>}.{</p>}`

// ============= 4 Завдання =================
// Розробити регулярний вираз для перевірки сили пароля. Пароль повинен містити принаймні одну велику літеру, одну маленьку літеру, одну цифру, один спеціальний символ (!@#$%^&*) і мати довжину від 8 до 20 символів.

// ============= 5 Завдання =================
// Створіть групу радіокнопок для оцінки від 1 до 5.
// Додайте обробник події onchange для виявлення вибору користувача, а потім виведіть відповідне повідомлення (наприклад, "Дякуємо за вашу оцінку!").
